package com.green.day11.ch15;

public class ObjectRelation {
    /*
    객체간의 관계
    - is-A: 상속 처리
    - has-A: 멤버필드 처리

    예를들어 모바일폰, 스마트폰의 관계였을 때 "모바일은은 스마트폰이다" 어색하지 않으면
    이것은 is-A관계
    바바리안, 캐릭터 관계 >> "바바리안은 캐릭터이다." is-A관계

    -----

    예를들어 스피커, 자동차의 관계였을 때 "자동차는 스피커이다" 어색하다.
    "자동차에는 스피커가 있다(포함한다. 존재한다)"
    has-A관계 (자동차가 스피커를 가지고 있다.)
    바바리안, 도끼  >> "바바리안은 도끼이다" 어색하다.
    "바바리안은 도끼를 무기로 사용한다" has-A관계

    is-A, has-A로 처리할지는 온전히 개발자한테 달려있다. 관리가 유리한대로 하면된다.
    보통 말로 만들었을 때 어색하지 않는 문장이 관계를 설정하지만 100% 아니다.

     */
}
